package com.codewars.smallestunusedID_new;

/**
 * ” вас есть много данных дл€ управлени€, и, конечно же, вы используете
 * неотрицательные идентификаторы с нулевым отсчетом,
 * чтобы сделать каждый элемент данных уникальным!
 * <p>
 * ѕоэтому вам нужен метод, который возвращает наименьший
 * неиспользуемый идентификатор дл€ вашего следующего нового элемента данных ...
 * <p>
 * ѕримечание. ”казанный массив использованных
 * идентификаторов может быть несортированным.
 * ѕо причинам тестировани€ могут быть повтор€ющиес€ идентификаторы,
 * но вам не нужно их искать или удал€ть!
 */
public class Kata {
    public static int nextId(int[] ids) {
        // Your code here
        return 0;
    }
}